tasks/03-conf/src/Configuration/Documents/ПриходДенег.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>ПриходДенег</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

tasks/03-conf/src/Configuration/AccountingRegisters/Управленческий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccountingRegister>
		<Properties>
			<Name>Управленческий</Name>
			<ChartOfAccounts>ChartOfAccounts.Управленческий</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаВал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Управленческий.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

tasks/03-conf/src/Configuration/Documents/ПриходДенег/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// ===== ФИКСАЦИЯ И БЛОКИРОВКА ДВИЖЕНИЙ =====
	// Записываем сформированные ранее движения и включаем их в обработку
	Движения.Управленческий.Записать();
	Движения.Управленческий.Записывать = Истина;
	
	// Блокируем запись в регистр для контрагента, чтобы избежать параллельных операций
	// с одной и той же задолженностью от разных пользователей
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрБухгалтерии.Управленческий");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Счет", ПланыСчетов.Управленческий.Покупатели);
	ЭлементБлокировки.УстановитьЗначение(ПланыВидовХарактеристик.ВидыСубконто.Покупатели, Контрагент);
	Блокировка.Заблокировать();
	
	// ===== ПОЛУЧЕНИЕ ТЕКУЩЕЙ ЗАДОЛЖЕННОСТИ =====
	// Запрос получает остатки задолженности контрагента по договорам
	// Упорядочиваем по убыванию суммы для гашения наибольших задолженностей первыми
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УправленческийОстатки.Субконто2 КАК Договор,
		|	УправленческийОстатки.СуммаВалОстаток КАК СуммаВалОстаток,
		|	УправленческийОстатки.СуммаОстаток КАК СуммаОстаток,
		|	УправленческийОстатки.Субконто1 КАК Контрагент
		|ИЗ
		|	РегистрБухгалтерии.Управленческий.Остатки(&МоментВремени, Счет = &Счет, &ВидыСубконто, Субконто1 = &Контрагент) КАК УправленческийОстатки
		|
		|УПОРЯДОЧИТЬ ПО
		|	СуммаОстаток УБЫВ
		|ИТОГИ
		|	СУММА(СуммаОстаток)
		|ПО
		|	Контрагент";
	
	// Подготавливаем массив видов субконто для фильтрации в запросе
	ВидыСубконто = Новый Массив;
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Покупатели);
	ВидыСубконто.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Договоры);
	
	Запрос.УстановитьПараметр("ВидыСубконто", ВидыСубконто);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Счет", ПланыСчетов.Управленческий.Покупатели);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	// ===== КОНТРОЛЬ И РАСПРЕДЕЛЕНИЕ ОПЛАТЫ =====
	ВыборкаКонтрагент = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если ВыборкаКонтрагент.Следующий() Тогда
		// Проверяем, что сумма оплаты не превышает общую задолженность
		Если СуммаДокумента > ВыборкаКонтрагент.СуммаОстаток Тогда
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Попытка произвести оплату больше задолженности!";
			Сообщение.Сообщить();
			Возврат;
		КонецЕсли;
		
		// Распределяем оплату по договорам (принцип FIFO по сумме)
		Выборка = ВыборкаКонтрагент.Выбрать();
		
		СуммаСписать = СуммаДокумента;
		
		Пока Выборка.Следующий() И СуммаСписать > 0 Цикл
			// Списываем либо всю задолженность по договору, либо часть
			СуммаТемп = Мин(Выборка.СуммаОстаток, СуммаСписать);
			
			 // Пропорциональный расчет валютной суммы
			Если СуммаТемп = Выборка.СуммаОстаток Тогда
				СуммаВал = Выборка.СуммаВалОстаток;
			Иначе
				СуммаВал = Выборка.СуммаВалОстаток * СуммаТемп / Выборка.СуммаОстаток;
			КонецЕсли;
			
			// Формируем проводку по оплате: уменьшаем задолженность, увеличиваем кассу
			Движение = Движения.Управленческий.Добавить();
			Движение.Период = Дата;
			Движение.СчетДт = ПланыСчетов.Управленческий.Касса;  // Увеличение актива
			Движение.СчетКт = ПланыСчетов.Управленческий.Покупатели;  // Уменьшение задолженности
			Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Покупатели] = Контрагент;
			Движение.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконто.Договоры] = Выборка.Договор;
			Движение.СуммаВалКт = СуммаВал;
			Движение.Сумма = СуммаТемп;
			
			СуммаСписать = СуммаСписать - СуммаТемп;
			
		КонецЦикла;
	Иначе
		// Если у контрагента нет задолженности, отказываем в проведении
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Контрагент не имеет задолженности!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
КонецПроцедуры
